In [1]:
import pandas as pd

In [2]:
name_list = pd.read_csv("yinchoo_class.csv")

In [3]:
name_list

  Class     Name
0  2TA1     Alex
1  2TA1  William
2  2TA1    Nancy
3  2TB1      Yan
4  2TB1    Louis
5  2TB1    Peter

In [4]:
name = name_list["Name"].sample()

In [5]:
print(name.astype("str"))

4    Louis
Name: Name, dtype: object

In [6]:
print(f"I am {name}")

I am 4    Louis
Name: Name, dtype: object

In [13]:
name = name_list[name_list["Class"] == "2TA1"].groupby(["Class"]).sample()
name

  Class  Name
0  2TA1  Alex